logs/fio-diskseq/GWDG 4v 8GB/000/log002.txt
+ mkdir -p tmp
+ cd tmp
+ fio --rw=write --name=kube-fio-write --output-format=normal,terse --bs=256k --size=16G
kube-fio-write: (g=0): rw=write, bs=(R) 256KiB-256KiB, (W) 256KiB-256KiB, (T) 256KiB-256KiB, ioengine=psync, iodepth=1
fio-3.28
Starting 1 process
3;fio-3.28;kube-fio-write;0;0;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;16777216;210528;822;79691;0;0;0.000000;0.000000;86;577141;1203.572469;6468.945298;1.000000%=90;5.000000%=95;10.000000%=109;20.000000%=124;30.000000%=164;40.000000%=171;50.000000%=177;60.000000%=183;70.000000%=193;80.000000%=216;90.000000%=292;95.000000%=10027;99.000000%=14745;99.500000%=15007;99.900000%=15138;99.950000%=15400;99.990000%=371195;0%=0;0%=0;0%=0;88;577148;1208.950312;6468.989172;34816;1940480;100.000000%;210739.924528;147103.207276;0.488142%;14.955452%;6076;0;15;100.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;7.37%;78.90%;5.54%;0.04%;0.01%;0.03%;0.03%;3.02%;5.03%;0.00%;0.00%;0.01%;0.01%;0.01%;0.00%;0.00%;0.00%;vda;0;12714;0;27;0;4002136;4004510;98.33%

kube-fio-write: (groupid=0, jobs=1): err= 0: pid=1112: Sat Jan  6 00:16:06 2024
  write: IOPS=822, BW=206MiB/s (216MB/s)(16.0GiB/79691msec); 0 zone resets
    clat (usec): min=86, max=577141, avg=1203.57, stdev=6468.95
     lat (usec): min=88, max=577148, avg=1208.95, stdev=6468.99
    clat percentiles (usec):
     |  1.00th=[    91],  5.00th=[    96], 10.00th=[   110], 20.00th=[   125],
     | 30.00th=[   165], 40.00th=[   172], 50.00th=[   178], 60.00th=[   184],
     | 70.00th=[   194], 80.00th=[   217], 90.00th=[   293], 95.00th=[ 10028],
     | 99.00th=[ 14746], 99.50th=[ 15008], 99.90th=[ 15139], 99.95th=[ 15401],
     | 99.99th=[371196]
   bw (  KiB/s): min=34816, max=1940480, per=100.00%, avg=210739.92, stdev=147103.21, samples=159
   iops        : min=  136, max= 7580, avg=823.19, stdev=574.62, samples=159
  lat (usec)   : 100=7.37%, 250=78.90%, 500=5.54%, 750=0.04%, 1000=0.01%
  lat (msec)   : 2=0.03%, 4=0.03%, 10=3.02%, 20=5.03%, 250=0.01%
  lat (msec)   : 500=0.01%, 750=0.01%
  cpu          : usr=0.49%, sys=14.96%, ctx=6076, majf=0, minf=15
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,65536,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=206MiB/s (216MB/s), 206MiB/s-206MiB/s (216MB/s-216MB/s), io=16.0GiB (17.2GB), run=79691-79691msec

Disk stats (read/write):
  vda: ios=0/12714, merge=0/27, ticks=0/4002136, in_queue=4004510, util=98.33%
+ fio --rw=read --name=kube-fio-read --output-format=normal,terse --bs=256k --size=16G
kube-fio-read: (g=0): rw=read, bs=(R) 256KiB-256KiB, (W) 256KiB-256KiB, (T) 256KiB-256KiB, ioengine=psync, iodepth=1
fio-3.28
Starting 1 process
3;fio-3.28;kube-fio-read;0;0;16777216;122868;479;136546;0;0;0.000000;0.000000;83;611366;2075.171482;3488.233709;1.000000%=238;5.000000%=497;10.000000%=593;20.000000%=962;30.000000%=1335;40.000000%=1679;50.000000%=1892;60.000000%=2039;70.000000%=2179;80.000000%=2408;90.000000%=2965;95.000000%=4014;99.000000%=10027;99.500000%=16449;99.900000%=36962;99.950000%=49545;99.990000%=74973;0%=0;0%=0;0%=0;83;611367;2075.462426;3488.230674;6656;151552;100.000000%;122957.106618;23191.325201;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;0.216778%;8.132850%;65571;0;77;100.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;0.02%;1.04%;4.15%;9.35%;6.35%;35.87%;38.23%;4.00%;0.62%;0.33%;0.04%;0.01%;0.00%;0.01%;0.00%;0.00%;0.00%;vda;65495;642;0;6;261869;65748;327681;99.50%

kube-fio-read: (groupid=0, jobs=1): err= 0: pid=1116: Sat Jan  6 00:18:26 2024
  read: IOPS=479, BW=120MiB/s (126MB/s)(16.0GiB/136546msec)
    clat (usec): min=83, max=611366, avg=2075.17, stdev=3488.23
     lat (usec): min=83, max=611367, avg=2075.46, stdev=3488.23
    clat percentiles (usec):
     |  1.00th=[  239],  5.00th=[  498], 10.00th=[  594], 20.00th=[  963],
     | 30.00th=[ 1336], 40.00th=[ 1680], 50.00th=[ 1893], 60.00th=[ 2040],
     | 70.00th=[ 2180], 80.00th=[ 2409], 90.00th=[ 2966], 95.00th=[ 4015],
     | 99.00th=[10028], 99.50th=[16450], 99.90th=[36963], 99.95th=[49546],
     | 99.99th=[74974]
   bw (  KiB/s): min= 6656, max=151552, per=100.00%, avg=122957.11, stdev=23191.33, samples=272
   iops        : min=   26, max=  592, avg=480.30, stdev=90.61, samples=272
  lat (usec)   : 100=0.02%, 250=1.04%, 500=4.15%, 750=9.35%, 1000=6.35%
  lat (msec)   : 2=35.87%, 4=38.23%, 10=4.00%, 20=0.62%, 50=0.33%
  lat (msec)   : 100=0.04%, 250=0.01%, 750=0.01%
  cpu          : usr=0.22%, sys=8.13%, ctx=65571, majf=0, minf=77
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=65536,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=120MiB/s (126MB/s), 120MiB/s-120MiB/s (126MB/s-126MB/s), io=16.0GiB (17.2GB), run=136546-136546msec

Disk stats (read/write):
  vda: ios=65495/642, merge=0/6, ticks=261869/65748, in_queue=327681, util=99.50%