logs/fio-diskseq/GWDG 4v 8GB/000/log007.txt
+ mkdir -p tmp
+ cd tmp
+ fio --rw=write --name=kube-fio-write --output-format=normal,terse --bs=256k --size=16G
kube-fio-write: (g=0): rw=write, bs=(R) 256KiB-256KiB, (W) 256KiB-256KiB, (T) 256KiB-256KiB, ioengine=psync, iodepth=1
fio-3.28
Starting 1 process
3;fio-3.28;kube-fio-write;0;0;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;16777216;210620;822;79656;0;0;0.000000;0.000000;85;558855;1203.521851;6494.631946;1.000000%=89;5.000000%=92;10.000000%=101;20.000000%=142;30.000000%=173;40.000000%=177;50.000000%=181;60.000000%=187;70.000000%=197;80.000000%=222;90.000000%=288;95.000000%=10027;99.000000%=14614;99.500000%=14614;99.900000%=15138;99.950000%=15269;99.990000%=375390;0%=0;0%=0;0%=0;88;558860;1208.435532;6494.641558;11776;1900032;100.000000%;212091.139241;145602.842732;0.449438%;15.418994%;6243;0;15;100.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;9.51%;76.01%;6.32%;0.10%;0.02%;0.03%;0.01%;3.01%;4.96%;0.01%;0.00%;0.01%;0.01%;0.01%;0.00%;0.00%;0.00%;vda;0;13437;0;29;0;3980220;3982648;98.79%

kube-fio-write: (groupid=0, jobs=1): err= 0: pid=1206: Sat Jan  6 00:35:30 2024
  write: IOPS=822, BW=206MiB/s (216MB/s)(16.0GiB/79656msec); 0 zone resets
    clat (usec): min=85, max=558855, avg=1203.52, stdev=6494.63
     lat (usec): min=88, max=558860, avg=1208.44, stdev=6494.64
    clat percentiles (usec):
     |  1.00th=[    90],  5.00th=[    93], 10.00th=[   102], 20.00th=[   143],
     | 30.00th=[   174], 40.00th=[   178], 50.00th=[   182], 60.00th=[   188],
     | 70.00th=[   198], 80.00th=[   223], 90.00th=[   289], 95.00th=[ 10028],
     | 99.00th=[ 14615], 99.50th=[ 14615], 99.90th=[ 15139], 99.95th=[ 15270],
     | 99.99th=[375391]
   bw (  KiB/s): min=11776, max=1900032, per=100.00%, avg=212091.14, stdev=145602.84, samples=158
   iops        : min=   46, max= 7422, avg=828.48, stdev=568.76, samples=158
  lat (usec)   : 100=9.51%, 250=76.01%, 500=6.32%, 750=0.10%, 1000=0.02%
  lat (msec)   : 2=0.03%, 4=0.01%, 10=3.01%, 20=4.96%, 50=0.01%
  lat (msec)   : 250=0.01%, 500=0.01%, 750=0.01%
  cpu          : usr=0.45%, sys=15.42%, ctx=6243, majf=0, minf=15
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,65536,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=206MiB/s (216MB/s), 206MiB/s-206MiB/s (216MB/s-216MB/s), io=16.0GiB (17.2GB), run=79656-79656msec

Disk stats (read/write):
  vda: ios=0/13437, merge=0/29, ticks=0/3980220, in_queue=3982648, util=98.79%
+ fio --rw=read --name=kube-fio-read --output-format=normal,terse --bs=256k --size=16G
kube-fio-read: (g=0): rw=read, bs=(R) 256KiB-256KiB, (W) 256KiB-256KiB, (T) 256KiB-256KiB, ioengine=psync, iodepth=1
fio-3.28
Starting 1 process
3;fio-3.28;kube-fio-read;0;0;16777216;123192;481;136187;0;0;0.000000;0.000000;91;212049;2069.854692;2687.423729;1.000000%=264;5.000000%=493;10.000000%=577;20.000000%=970;30.000000%=1368;40.000000%=1695;50.000000%=1908;60.000000%=2039;70.000000%=2179;80.000000%=2375;90.000000%=2932;95.000000%=3948;99.000000%=9895;99.500000%=17432;99.900000%=33816;99.950000%=50069;99.990000%=78118;0%=0;0%=0;0%=0;91;212049;2070.110114;2687.421159;7680;152576;100.000000%;123282.823529;21766.531156;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;0.249659%;8.371639%;65659;0;76;100.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;0.01%;0.93%;4.56%;9.66%;5.57%;35.91%;38.52%;3.86%;0.55%;0.38%;0.05%;0.01%;0.00%;0.00%;0.00%;0.00%;0.00%;vda;65586;690;0;25;261808;70667;332699;99.61%

kube-fio-read: (groupid=0, jobs=1): err= 0: pid=1210: Sat Jan  6 00:37:50 2024
  read: IOPS=481, BW=120MiB/s (126MB/s)(16.0GiB/136187msec)
    clat (usec): min=91, max=212049, avg=2069.85, stdev=2687.42
     lat (usec): min=91, max=212049, avg=2070.11, stdev=2687.42
    clat percentiles (usec):
     |  1.00th=[  265],  5.00th=[  494], 10.00th=[  578], 20.00th=[  971],
     | 30.00th=[ 1369], 40.00th=[ 1696], 50.00th=[ 1909], 60.00th=[ 2040],
     | 70.00th=[ 2180], 80.00th=[ 2376], 90.00th=[ 2933], 95.00th=[ 3949],
     | 99.00th=[ 9896], 99.50th=[17433], 99.90th=[33817], 99.95th=[50070],
     | 99.99th=[78119]
   bw (  KiB/s): min= 7680, max=152576, per=100.00%, avg=123282.82, stdev=21766.53, samples=272
   iops        : min=   30, max=  596, avg=481.57, stdev=85.03, samples=272
  lat (usec)   : 100=0.01%, 250=0.93%, 500=4.56%, 750=9.66%, 1000=5.57%
  lat (msec)   : 2=35.91%, 4=38.52%, 10=3.86%, 20=0.55%, 50=0.38%
  lat (msec)   : 100=0.05%, 250=0.01%
  cpu          : usr=0.25%, sys=8.37%, ctx=65659, majf=0, minf=76
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=65536,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=120MiB/s (126MB/s), 120MiB/s-120MiB/s (126MB/s-126MB/s), io=16.0GiB (17.2GB), run=136187-136187msec

Disk stats (read/write):
  vda: ios=65586/690, merge=0/25, ticks=261808/70667, in_queue=332699, util=99.61%